{
    "zip": "10019",
    "sector": "Financial Services",
    "fullTimeEmployees": 1384,
    "longBusinessSummary": "KKR & Co. Inc. is a private equity and real estate investment firm specializing in direct and fund of fund investments. It specializes in acquisitions, leveraged buyouts, management buyouts, credit special situations, growth equity, mature, mezzanine, distressed, turnaround, lower middle market and middle market investments. The firm considers investments in all industries with a focus on software, security, semiconductors, consumer electronics, internet of things (iot), internet, information services, information technology infrastructure, financial technology, network and cyber security architecture, engineering and operations, content, technology and hardware, energy and infrastructure, real estate, services industry with a focus on business services, intelligence, industry-leading franchises and companies in natural resource, containers and packaging, agriculture, airports, ports, forestry, electric utilities, textiles, apparel and luxury goods, household durables, digital media, insurance, brokerage houses, non-durable goods distribution, supermarket retailing, grocery stores, food, beverage, and tobacco, hospitals, entertainment venues and production companies, publishing, printing services, capital goods, financial services, specialized finance, pipelines, and renewable energy. In energy and infrastructure, it focuses on the upstream oil and gas and equipment, minerals and royalties and services verticals. In real estate, the firm seeks to invest in private and public real estate securities including property-level equity, debt and special situations transactions and businesses with significant real estate holdings, and oil and natural gas properties. The firm also invests in asset services sector that encompasses a broad array of B2B, B2C and B2G services verticals including asset-based, transport, logistics, leisure/hospitality, resource and utility support, infra-like, mission-critical, and environmental services. Within Americas, the firm prefers to invest in consumer products; chemicals, metals and mining; energy and natural resources; financial services; healthcare; industrials; media and communications; retail; and technology. Within Europe, the firm invests in consumer and retail; energy; financial services; health care; industrials and chemicals; media and digital; and telecom and technologies. Within Asia, it invests in consumer products; energy and resources; financial services; healthcare; industrials; logistics; media and telecom; retail; real estate; and technology. It also seeks to make impact investments focused on identifying and investing behind businesses with positive social or environmental impact. The firm seeks to invest in mid to high-end residential developments, but can invest in other projects throughout Mainland China through outright ownership, joint ventures, and merger. It invests globally with a focus on Australia, emerging and developed Asia, Middle East and Africa, Nordic, Southeast Asia, Asia Pacific, Ireland, Hong Kong, Japan, Taiwan, India, Vietnam, Malaysia, Singapore, Indonesia, France, Germany, Netherlands, United Kingdom, Caribbean, Mexico, South America, North America, Brazil, Latin America, Korea with a focus on South Korea, and United States of America. In the United States and Europe, the firm focuses on buyouts of large, publicly traded companies. It seeks to invest $30 million to $717 million in companies with enterprise values between $500 million to $2389 million. The firm prefers to invest in a range of debt and public equity investing and may co-invest. It seeks a board seat in its portfolio companies and a controlling ownership of a company or a strategic minority positions. The firm may acquire majority and minority equity interests, particularly when making private equity investments in Asia or sponsoring investments as part of a large investor consortium. The firm typically holds its investment for a period of five to seven years and more and exits through initial public offerings, secondary offerings, and sales to strategic buyers. KKR & Co. Inc. was founded in 1976 and is based in New York, New York with additional offices across North America, Europe, Australia, and Asia.",
    "city": "New York",
    "phone": "212 750 8300",
    "state": "NY",
    "country": "United States",
    "companyOfficers": [],
    "website": "http://www.kkr.com",
    "maxAge": 1,
    "address1": "9 West 57th Street",
    "industry": "Asset Management",
    "address2": "Suite 4200",
    "previousClose": 28.96,
    "regularMarketOpen": 29.6,
    "twoHundredDayAverage": 29.006569,
    "trailingAnnualDividendYield": 0.017265193,
    "payoutRatio": 0.1412,
    "volume24Hr": null,
    "regularMarketDayHigh": 29.64,
    "navPrice": null,
    "averageDailyVolume10Day": 4382875,
    "totalAssets": null,
    "regularMarketPreviousClose": 28.96,
    "fiftyDayAverage": 31.583529,
    "trailingAnnualDividendRate": 0.5,
    "open": 29.6,
    "averageVolume10days": 4382875,
    "expireDate": null,
    "yield": null,
    "algorithm": null,
    "dividendRate": 0.5,
    "exDividendDate": 1581033600,
    "beta": 1.786219,
    "circulatingSupply": null,
    "startDate": null,
    "regularMarketDayLow": 28.64,
    "priceHint": 2,
    "currency": "USD",
    "trailingPE": 8.31356,
    "regularMarketVolume": 2874187,
    "lastMarket": null,
    "maxSupply": null,
    "openInterest": null,
    "marketCap": 24969207808,
    "volumeAllCurrencies": null,
    "strikePrice": null,
    "averageVolume": 3207622,
    "priceToSalesTrailing12Months": 3.157739,
    "dayLow": 28.64,
    "ask": 29.99,
    "ytdReturn": null,
    "askSize": 1200,
    "volume": 2874187,
    "fiftyTwoWeekHigh": 34.14,
    "forwardPE": 12.795652,
    "fromCurrency": null,
    "fiveYearAvgDividendYield": 4.77,
    "fiftyTwoWeekLow": 22.01,
    "bid": 0,
    "tradeable": true,
    "dividendYield": 0.0173,
    "bidSize": 900,
    "dayHigh": 29.64,
    "exchange": "NYQ",
    "shortName": "KKR & Co. Inc.",
    "longName": "KKR & Co. Inc.",
    "exchangeTimezoneName": "America/New_York",
    "exchangeTimezoneShortName": "EST",
    "isEsgPopulated": false,
    "gmtOffSetMilliseconds": "-18000000",
    "quoteType": "EQUITY",
    "symbol": "KKR",
    "messageBoardId": "finmb_21401",
    "market": "us_market",
    "annualHoldingsTurnover": null,
    "enterpriseToRevenue": 7.713,
    "beta3Year": null,
    "profitMargins": 0.25357,
    "enterpriseToEbitda": null,
    "52WeekChange": 0.27184892,
    "morningStarRiskRating": null,
    "forwardEps": 2.3,
    "revenueQuarterlyGrowth": null,
    "sharesOutstanding": 560008000,
    "fundInceptionDate": null,
    "annualReportExpenseRatio": null,
    "bookValue": 18.437,
    "sharesShort": 11945836,
    "sharesPercentSharesOut": 0.014099999,
    "fundFamily": null,
    "lastFiscalYearEnd": 1577750400,
    "heldPercentInstitutions": 0.79794997,
    "netIncomeToCommon": 1971684992,
    "trailingEps": 3.54,
    "lastDividendValue": null,
    "SandP52WeekChange": 0.08368194,
    "priceToBook": 1.5962467,
    "heldPercentInsiders": 0.043,
    "nextFiscalYearEnd": 1640908800,
    "mostRecentQuarter": 1577750400,
    "shortRatio": 3.45,
    "sharesShortPreviousMonthDate": 1579046400,
    "floatShares": 486013536,
    "enterpriseValue": 60991938560,
    "threeYearAverageReturn": null,
    "lastSplitDate": null,
    "lastSplitFactor": null,
    "legalType": null,
    "morningStarOverallRating": null,
    "earningsQuarterlyGrowth": null,
    "dateShortInterest": 1581638400,
    "pegRatio": 4.5,
    "lastCapGain": null,
    "shortPercentOfFloat": 0.0225,
    "sharesShortPriorMonth": 14238976,
    "category": null,
    "fiveYearAverageReturn": null,
    "regularMarketPrice": 29.6,
    "logo_url": "https://logo.clearbit.com/kkr.com"
}